START TRANSACTION;

-- DELETE FROM users;
-- DELETE FROM campus;
-- DELETE FROM university;


INSERT INTO university
(id, name, short_name, description, logo_url, official_website, is_985, is_211, is_double_first_class, school_type,
 province, city, is_deleted)
VALUES (1, '北京邮电大学', '北邮', '信息与通信特色高校，MVP重点完善数据。', 'https://www.bupt.edu.cn',
        'https://www.bupt.edu.cn', 1, 1, 1, '理工', '北京', '北京', 0),
       (2, '北京航空航天大学', '北航', '航空航天特色高校，MVP重点完善数据。', 'https://www.buaa.edu.cn',
        'https://www.buaa.edu.cn', 1, 1, 1, '理工', '北京', '北京', 0),
       (3, '清华大学', '清华', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '北京', '北京', 0),
       (4, '北京大学', '北大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '北京', '北京', 0),
       (5, '中国人民大学', '人大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '北京', '北京', 0),
       (6, '北京理工大学', '北理工', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '北京', '北京', 0),
       (7, '北京师范大学', '北师大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '师范', '北京', '北京', 0),
       (8, '同济大学', '同济', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '上海', '上海', 0),
       (9, '复旦大学', '复旦', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '上海', '上海', 0),
       (10, '上海交通大学', '上交', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '上海', '上海', 0),
       (11, '华东师范大学', '华师大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '师范', '上海', '上海', 0),
       (12, '浙江大学', '浙大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '浙江', '杭州', 0),
       (13, '南京大学', '南大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '江苏', '南京', 0),
       (14, '东南大学', '东南', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '江苏', '南京', 0),
       (15, '武汉大学', '武大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '湖北', '武汉', 0),
       (16, '华中科技大学', '华科', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '湖北', '武汉', 0),
       (17, '中国科学技术大学', '中科大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '安徽', '合肥', 0),
       (18, '哈尔滨工业大学', '哈工大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '黑龙江', '哈尔滨', 0),
       (19, '西安交通大学', '西交', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '陕西', '西安', 0),
       (20, '西北工业大学', '西工大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '陕西', '西安', 0),
       (21, '电子科技大学', '电子科大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '四川', '成都', 0),
       (22, '四川大学', '川大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '四川', '成都', 0),
       (23, '重庆大学', '重大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '重庆', '重庆', 0),
       (24, '中山大学', '中大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '广东', '广州', 0),
       (25, '华南理工大学', '华南理工', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '广东', '广州', 0),
       (26, '厦门大学', '厦大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '福建', '厦门', 0),
       (27, '山东大学', '山大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '山东', '济南', 0),
       (28, '吉林大学', '吉大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '吉林', '长春', 0),
       (29, '大连理工大学', '大工', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '辽宁', '大连', 0),
       (30, '天津大学', '天大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '理工', '天津', '天津', 0),
       (31, '南开大学', '南开', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '天津', '天津', 0),
       (32, '湖南大学', '湖大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '湖南', '长沙', 0),
       (33, '中南大学', '中南', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '湖南', '长沙', 0),
       (34, '兰州大学', '兰大', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '综合', '甘肃', '兰州', 0),
       (35, '西北大学', '西大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '综合', '陕西', '西安', 0),
       (36, '西北农林科技大学', '西农', '占位数据，待完善。', NULL, NULL, 1, 1, 1, '农林', '陕西', '咸阳', 0),
       (37, '云南大学', '云大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '综合', '云南', '昆明', 0),
       (38, '郑州大学', '郑大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '综合', '河南', '郑州', 0),
       (39, '苏州大学', '苏大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '综合', '江苏', '苏州', 0),
       (40, '深圳大学', '深大', '占位数据，待完善。', NULL, NULL, 0, 0, 1, '综合', '广东', '深圳', 0),
       (41, '北京交通大学', '北交', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '北京', '北京', 0),
       (42, '北京科技大学', '北科', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '北京', '北京', 0),
       (43, '南京航空航天大学', '南航', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '江苏', '南京', 0),
       (44, '南京理工大学', '南理工', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '江苏', '南京', 0),
       (45, '华东理工大学', '华理', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '上海', '上海', 0),
       (46, '武汉理工大学', '武理', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '湖北', '武汉', 0),
       (47, '西安电子科技大学', '西电', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '陕西', '西安', 0),
       (48, '北京工业大学', '北工大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '北京', '北京', 0),
       (49, '华南师范大学', '华南师大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '师范', '广东', '广州', 0),
       (50, '福州大学', '福大', '占位数据，待完善。', NULL, NULL, 0, 1, 1, '理工', '福建', '福州', 0);


INSERT INTO campus
(uni_id, name, address, province, city, lat, lng, description, main_gate, hot_score, data_status, is_deleted)
VALUES (1, '西土城校区', '北京市海淀区西土城路10号', '北京', '北京', 39.968200, 116.353700,
        '北邮老校区，历史与科研氛围浓厚。', '西土城路校门', 95, 1, 0),
       (1, '沙河校区', '北京市昌平区沙河高教园', '北京', '北京', 40.164100, 116.280300,
        '北邮新校区，空间开阔，生活设施较新。', '沙河校区南门', 88, 1, 0),
       (2, '学院路校区', '北京市海淀区学院路37号', '北京', '北京', 39.981900, 116.348400, '北航主校区，教学科研核心区。',
        '学院路校门', 96, 1, 0),
       (2, '沙河校区', '北京市昌平区沙河高教园', '北京', '北京', 40.163500, 116.280900,
        '北航新校区，教学与生活功能完善。', '沙河校区东门', 89, 1, 0);




INSERT INTO users
(username, password, nickname, avatar_url, role, identity_type, high_school, target_uni_id, current_uni_id, phone_number, email, bio, status, is_deleted)
VALUES
    ('xiaochen',   '123456', '小陈',     NULL, 0, 2, '北京市第四中学', NULL, 1, '13800000001', 'xiaochen@example.com', '后端学习中', 1, 0),
    ('user01',     '123456', '测试01',   NULL, 0, 1, '人大附中',       1, NULL, '13800000002', 'user01@example.com',   '目标北邮',   1, 0),
    ('user02',     '123456', '测试02',   NULL, 0, 1, '衡水中学',       1, NULL, '13800000003', 'user02@example.com',   '准备参访',   1, 0),
    ('user03',     '123456', '测试03',   NULL, 0, 2, '成都七中',       NULL, 1, '13800000004', 'user03@example.com',   '已在校',     1, 0),
    ('user04',     '123456', '测试04',   NULL, 0, 2, '华师一附中',     NULL, 1, '13800000005', 'user04@example.com',   '喜欢打卡',   1, 0),
    ('user05',     '123456', '测试05',   NULL, 0, 2, '深圳中学',       NULL, 1, '13800000006', 'user05@example.com',   '看校园攻略', 1, 0),
    ('user06',     '123456', '测试06',   NULL, 0, 1, '长沙一中',       1, NULL, '13800000007', 'user06@example.com',   '准备报考',   1, 0),
    ('user07',     '123456', '测试07',   NULL, 0, 2, '西工大附中',     NULL, 1, '13800000008', 'user07@example.com',   '先小后大',   1, 0),
    ('user08',     '123456', '测试08',   NULL, 0, 2, '厦门双十中学',   NULL, 1, '13800000009', 'user08@example.com',   '联调账号',   1, 0),
    ('admin01',    '123456', '管理员',   NULL, 9, 2, NULL,             NULL, 1, '13800000010', 'admin@example.com',    '系统管理',   1, 0)
ON DUPLICATE KEY UPDATE
                     nickname = VALUES(nickname),
                     role = VALUES(role),
                     identity_type = VALUES(identity_type),
                     target_uni_id = VALUES(target_uni_id),
                     current_uni_id = VALUES(current_uni_id),
                     status = VALUES(status),
                     is_deleted = VALUES(is_deleted);


-- 给剩余高校添加占位符
INSERT INTO campus
(uni_id, name, address, province, city, lat, lng, description, main_gate, hot_score, data_status, is_deleted)
SELECT u.id,
       '主校区',
       CONCAT(u.city, '（地址待完善）'),
       u.province,
       u.city,
       NULL,
       NULL,
       '占位校区数据，后续补充。',
       '待完善',
       0,
       0,
       0
FROM university u
WHERE u.id >= 3;



COMMIT;
